basic/controllers/IndexController.php

    public function actionList(){
        $str='';
         $param= $this->request->get();
            if($param['username'] !== 'null'){
                $userModel= new Users();
                $userInfo=$userModel::find()->andFilterWhere(['like', 'name', $param['username']])->asArray()->all();
---
SELECT * FROM `users`

        $count = count($count);
        $provider = new SqlDataProvider([ 'sql' =>$sql,  'totalCount' => $count, 'pagination' => [ 'pageSize' => 10, ], 'sort' => [ 'attributes' => [ 'orderId', 'money', 'time', ], ] ]); // 返回包含每一行的数组$models = $provider->getModels();
        $area=new Area();
        $areaList=$area::find()->asArray()->all();
---
SELECT * FROM `area`