basic/views/fenpei/_search.php

    <?= $form->field($model, 'name') ?>

    <?= $form->field($model, 'userId') ?>
    <?= $form->field($model1, 'id')->listbox(
        ArrayHelper::map(\app\models\Department::find()->all(),'id','name')
    ) ?>
---
SELECT * FROM `department`